{
  "Email": "jcc0114@auburn.edu",
  "About": "I'm a Mechanical Engineering major with a Computer Science minor studying at Auburn University. I am passionate about pursuing the intersection of my disciplines and furthering both my understanding and usefulness to the field of aeronautics. I am currently working with the ABEX CubeSat program and completing the remainder of my studies. ",
    "Research Description": "I am focused on researching and providing cutting edge solutions to spacecraft engineering criteria.",
    "Research Papers": [
      {
        "title": "High-Fidelity Spacecraft Thermal Modeling: Synthesis of STK, SPENVIS, MATLAB, Simulink, and Thermal Desktop using Model-based Systems Engineering",
        "conference": "TBD",
        "affiliation": "Alabama Burst Energetics eXplorer Thermal & Radiation Team",
        "date": "2022",
        "file": "ABEX.png",
        "url": "TBD",
        "authors": "Halvorson, Cho, et al."
      }
    ],
    "Experience Description Part 1": "I have honed my professional and technical skills with  ",
    "Experience Description Part 2": ", and my expertise extends to a cross-disciplinary variety of engineering applications and a plethora of academic and professional pursuits.",
  
    "Professional Experience": [
      {
        "company": "Intuitive Research and Technology",
        "location": "On Campus, Huntsville AL",
        "title": "Mechanical Engineering Co-op 1st semester",
        "description": "I headed up initial design considerations and mechanical solutions for an avionics based prototype integration defense project located on the Redstone Arsenal. I worked alongside engineers of various disciplines to provide them with accurate models and analysis to facilitate accelerated component integration.",
        "date": "May 2020 - August 2020",
        "file": "intuitive.png"
      },
      {
        "company": "Intuitive Research and Technology",
        "location": "On Campus, Huntsville AL",
        "title": "Mechanical Engineering Co-op 2nd semester",
        "description": "I designed and completed the necessary technical documentation associated with my tasking during my first semester, ranging from an Interface Control Document (ICD) to an Acceptance Test Procedure (ATP) for valdiating those prototype modifications.",
        "date": "January 2021 - May 2021",
        "file": "intuitive.png"
      },
      {
        "company": "Intuitive Research and Technology",
        "location": "On Campus, Huntsville AL",
        "title": "Mechanical Engineering Co-op 3rd semseter",
        "description": "I joined a mutli-disciplinary and multi-company team of test site engineers to provide support to mechanical system diagnostics testing as well as implement software package validation for field use.",
        "date": "August 2021 - December 2021",
        "file": "intuitive.png"
      }
      
    ],
    "Selected Academic Projects": [
      {
        "company": "Alabama Burst Energetics eXplorer Thermal & Radiation Team",
        "location": "Auburn, AL",
        "title": "Thermal Control Team Manager",
        "description": "I maintained and directed a 6 person team of Mechanical Engineers tasked with developing simulation software and models for the ABEX CubeSat program. Our tasking lays the foundation for future teams to begin building the physical satellite infrastructure.",
        "date": "January 2021 - Present",
        "file": "ABEX.png"
      },
      {
        "company": "Alabama Burst Energetics eXplorer Thermal & Radiation Team",
        "location": "Auburn AL",
        "title": "MATLAB Team Lead",
        "description": "In addition to my role and responsibilites as Team Manager, I had the task of managing and developing a first-pass isothermal model of the CubeSat's thermal condition during orbit in MATLAB. My model considered per-face variation in incident radiation and complex fresnel reflectivity, and is on the cutting edge of radiative thermal considerations in aeronautics.",
        "date": "January 2021 - Present",
        "file": "ABEX.png"
      },
      {
        "company": "Auburn University Mechanical Engineering",
        "location": "Auburn AL",
        "title": "Measurements and Sensor Development Team Lead",
        "description": "I organized a team of fellow engineering students to devlop, plan, and build an automated plant health maintenance unit for a class project. While not specifically professional in nature, I believe my dedication to actually building a physical working prototype using an arduino controller and servos instead of merely drawing up a plan represents a critical distinction in Engineering experience I display academically.",
        "date": "June 2021 - August 2021",
        "file": "auburn.png"
      }
    ],
   
    "Languages": [
        {
          "name": "Python",
          "file": "python.png"
        },
        {
          "name": "Java",
          "file": "java.png"
        },
        {
          "name": "MATLAB",
          "file": "matlab.png"
        },
        {
          "name": "C++",
          "file": "cplusplus.png"
        },
        {
          "name": "Javascript",
          "file": "javascript.png"
        }
  
      ],
      "Libraries": [
        {
          "name": "Pandas",
          "file": "pandas.png"
        },
        {
          "name": "PyTorch",
          "file": "pytorch.png"
        },
        {
          "name": "scikit-learn",
          "file": "scikit-learn.png"
        },
        {
          "name": "Tensorflow",
          "file": "tensorflow.png"
        }
      ],
      "Web Development": [
        {
          "name": "React.js",
          "file": "react.png"
        },
        {
          "name": "Node.js",
          "file": "node.png"
        },
        {
          "name": "CSS",
          "file": "css.png"
        }
      ],
      "Other": [
        {
          "name": "Git",
          "file": "git.png"
        },
        {
          "name": "Linux",
          "file": "linux.png"
        },
        {
          "name": "Jenkins",
          "file": "jenkins.png"
        },
        {
          "name": "REST API",
          "file": "restapi.png"
        }
      ]
    }